
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |        1 |          21 |            4 |
## Affected resources by action

|  Action  | Resources                                                                 |
|:--------:|:--------------------------------------------------------------------------|
|    🟢    | `module.actions-runner.module.record_metric.aws_s3_object.lambda_package` |
|    🟡    | `module.actions-runner.aws_autoscaling_group.actions-runner`              |
|    🟡    | `module.actions-runner.aws_autoscaling_policy.scale_out`                  |
|    🟡    | `module.actions-runner-noble.aws_autoscaling_group.actions-runner`        |
|    🟡    | `module.actions-runner-noble.aws_launch_template.actions-runner`          |
|    🟡    | `module.management.aws_default_route_table.default`                       |
|    🟡    | `module.management.aws_default_security_group.default`                    |
|    🟡    | `module.management.aws_eip.nat_eip["10.0.0.0/24"]`                        |
|    🟡    | `module.management.aws_internet_gateway.ig`                               |
|    🟡    | `module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]`                 |
|    🟡    | `module.management.aws_route.subnet_private["10.0.3.0/24"]`               |
|    🟡    | `module.management.aws_route_table.all["10.0.0.0/24"]`                    |
|    🟡    | `module.management.aws_route_table.all["10.0.1.0/24"]`                    |
|    🟡    | `module.management.aws_route_table.all["10.0.2.0/24"]`                    |
|    🟡    | `module.management.aws_route_table.all["10.0.3.0/24"]`                    |
|    🟡    | `module.management.aws_subnet.all["10.0.0.0/24"]`                         |
|    🟡    | `module.management.aws_subnet.all["10.0.1.0/24"]`                         |
|    🟡    | `module.management.aws_subnet.all["10.0.2.0/24"]`                         |
|    🟡    | `module.management.aws_subnet.all["10.0.3.0/24"]`                         |
|    🟡    | `module.management.aws_vpc.vpc`                                           |
|    🟡    | `module.management.aws_vpc_endpoint.s3`                                   |
|    🟡    | `module.actions-runner.module.record_metric.aws_lambda_function.lambda`   |
|    🔴    | `module.management.aws_eip.nat_eip["10.0.2.0/24"]`                        |
|    🔴    | `module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]`                 |
|    🔴    | `module.management.aws_vpc_security_group_egress_rule.default[0]`         |
|    🔴    | `module.management.aws_vpc_security_group_ingress_rule.default[0]`        |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.actions-runner.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
      ~ health_check_grace_period        = 60 -> 0
        id                               = "actions-runner-20250505203133108100000007-INx3ry"
      ~ max_size                         = 3 -> 1
        name                             = "actions-runner-20250505203133108100000007-INx3ry"
        # (29 unchanged attributes hidden)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id = "lt-08b47595a3bdafaf1"
                  + version            = "2"
                }
              + override (known after apply)
            }
        }

      - warm_pool {
          - max_group_prepared_capacity = 2 -> null
          - min_size                    = 2 -> null
          - pool_state                  = "Hibernated" -> null

          - instance_reuse_policy {
              - reuse_on_scale_in = true -> null
            }
        }

        # (13 unchanged blocks hidden)
    }

  # module.actions-runner.aws_autoscaling_policy.scale_out will be updated in-place
  ~ resource "aws_autoscaling_policy" "scale_out" {
      ~ cooldown                  = 180 -> 0
        id                        = "scale-out-idle-runners"
        name                      = "scale-out-idle-runners"
        # (9 unchanged attributes hidden)
    }

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
        id                               = "actions-runner-20250505203133193000000009-KWX4No"
        name                             = "actions-runner-20250505203133193000000009-KWX4No"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0fe52afb929ab485f"
            name    = "actions-runner-20250505203133193000000009"
          ~ version = "2" -> (known after apply)
        }

        # (13 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_launch_template.actions-runner will be updated in-place
  ~ resource "aws_launch_template" "actions-runner" {
        id                                   = "lt-0fe52afb929ab485f"
      ~ image_id                             = "ami-0f852f6b9cdfac2a8" -> "ami-0d613de781286fbe7"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "actions-runner-20250505203133193000000009"
        tags                                 = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.management.aws_default_route_table.default will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0d7c667410dd74382"
      ~ tags                   = {
            "Name"              = "Main table for 10.0.0.0/22"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "residency"         = "10.0.0.0/22"
            "service"           = "management"
        }
      ~ tags_all               = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.management.aws_default_security_group.default will be updated in-place
  ~ resource "aws_default_security_group" "default" {
        id                     = "sg-0d78fdc7582795224"
        name                   = "default"
      ~ tags                   = {
            "Name"              = "10.0.0.0/22 default"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "service"           = "management"
        }
      ~ tags_all               = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.management.aws_eip.nat_eip["10.0.0.0/24"] will be updated in-place
  ~ resource "aws_eip" "nat_eip" {
        id                       = "eipalloc-04aa7fec95ffd4b82"
      ~ tags                     = {
            "Name"              = "Elastic IP for NAT gateway"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "residency"         = "10.0.0.0/24"
            "service"           = "management"
        }
      ~ tags_all                 = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)
    }

  # module.management.aws_eip.nat_eip["10.0.2.0/24"] will be destroyed
  # (because key ["10.0.2.0/24"] is not in for_each map)
  - resource "aws_eip" "nat_eip" {
      - allocation_id            = "eipalloc-052de48896768bb9a" -> null
      - arn                      = "arn:aws:ec2:us-west-1:303467602807:elastic-ip/eipalloc-052de48896768bb9a" -> null
      - association_id           = "eipassoc-079047df17daa9e1d" -> null
      - domain                   = "vpc" -> null
      - id                       = "eipalloc-052de48896768bb9a" -> null
      - network_border_group     = "us-west-1" -> null
      - network_interface        = "eni-0fd8b7d53772f1f09" -> null
      - private_dns              = "ip-10-0-2-115.us-west-1.compute.internal" -> null
      - private_ip               = "10.0.2.115" -> null
      - public_dns               = "ec2-52-8-183-160.us-west-1.compute.amazonaws.com" -> null
      - public_ip                = "52.8.183.160" -> null
      - public_ipv4_pool         = "amazon" -> null
      - tags                     = {
          - "Name"        = "Elastic IP for NAT gateway"
          - "environment" = "development"
          - "residency"   = "10.0.2.0/24"
          - "service"     = "management"
        } -> null
      - tags_all                 = {
          - "Name"        = "Elastic IP for NAT gateway"
          - "created_by"  = "infrahouse/aws-control-303467602807"
          - "environment" = "development"
          - "residency"   = "10.0.2.0/24"
          - "service"     = "management"
        } -> null
      - vpc                      = true -> null
        # (5 unchanged attributes hidden)
    }

  # module.management.aws_internet_gateway.ig will be updated in-place
  ~ resource "aws_internet_gateway" "ig" {
        id       = "igw-07b2ce6a3329e43ed"
      ~ tags     = {
            "Name"              = "Internet gateway"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "service"           = "management"
        }
      ~ tags_all = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"] will be updated in-place
  ~ resource "aws_nat_gateway" "nat_gw" {
        id                                 = "nat-0346114bc72e2598d"
      ~ tags                               = {
            "Name"              = "NAT gateway"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "residency"         = "10.0.0.0/24"
            "service"           = "management"
        }
      ~ tags_all                           = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"] will be destroyed
  # (because key ["10.0.2.0/24"] is not in for_each map)
  - resource "aws_nat_gateway" "nat_gw" {
      - allocation_id                      = "eipalloc-052de48896768bb9a" -> null
      - association_id                     = "eipassoc-079047df17daa9e1d" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-0da5dc5227fd14a1d" -> null
      - network_interface_id               = "eni-0fd8b7d53772f1f09" -> null
      - private_ip                         = "10.0.2.115" -> null
      - public_ip                          = "52.8.183.160" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-004bd6d011ea52557" -> null
      - tags                               = {
          - "Name"        = "NAT gateway"
          - "environment" = "development"
          - "residency"   = "10.0.2.0/24"
          - "service"     = "management"
        } -> null
      - tags_all                           = {
          - "Name"        = "NAT gateway"
          - "created_by"  = "infrahouse/aws-control-303467602807"
          - "environment" = "development"
          - "residency"   = "10.0.2.0/24"
          - "service"     = "management"
        } -> null
    }

  # module.management.aws_route.subnet_private["10.0.3.0/24"] will be updated in-place
  ~ resource "aws_route" "subnet_private" {
        id                          = "r-rtb-0e201932568480e4c1080289494"
      ~ nat_gateway_id              = "nat-0da5dc5227fd14a1d" -> "nat-0346114bc72e2598d"
        # (17 unchanged attributes hidden)
    }

  # module.management.aws_route_table.all["10.0.0.0/24"] will be updated in-place
  ~ resource "aws_route_table" "all" {
        id               = "rtb-0621e4acb3e1256f8"
      ~ tags             = {
            "Name"              = "Table for 10.0.0.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "residency"         = "10.0.0.0/24"
            "service"           = "management"
        }
      ~ tags_all         = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.management.aws_route_table.all["10.0.1.0/24"] will be updated in-place
  ~ resource "aws_route_table" "all" {
        id               = "rtb-06e44dcf291b450e2"
      ~ tags             = {
            "Name"              = "Table for 10.0.1.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "residency"         = "10.0.1.0/24"
            "service"           = "management"
        }
      ~ tags_all         = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.management.aws_route_table.all["10.0.2.0/24"] will be updated in-place
  ~ resource "aws_route_table" "all" {
        id               = "rtb-0ad989bac96f0aaf2"
      ~ tags             = {
            "Name"              = "Table for 10.0.2.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "residency"         = "10.0.2.0/24"
            "service"           = "management"
        }
      ~ tags_all         = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.management.aws_route_table.all["10.0.3.0/24"] will be updated in-place
  ~ resource "aws_route_table" "all" {
        id               = "rtb-0e201932568480e4c"
      ~ tags             = {
            "Name"              = "Table for 10.0.3.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "residency"         = "10.0.3.0/24"
            "service"           = "management"
        }
      ~ tags_all         = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.management.aws_subnet.all["10.0.0.0/24"] will be updated in-place
  ~ resource "aws_subnet" "all" {
        id                                             = "subnet-0dbff142ba4620c5f"
      ~ tags                                           = {
            "Name"              = "management: public 10.0.0.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "management"        = "true"
            "service"           = "management"
        }
      ~ tags_all                                       = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.management.aws_subnet.all["10.0.1.0/24"] will be updated in-place
  ~ resource "aws_subnet" "all" {
        id                                             = "subnet-0a3a8e5a973c88986"
      ~ tags                                           = {
            "Name"              = "management: private 10.0.1.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "management"        = "true"
            "service"           = "management"
        }
      ~ tags_all                                       = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.management.aws_subnet.all["10.0.2.0/24"] will be updated in-place
  ~ resource "aws_subnet" "all" {
        id                                             = "subnet-004bd6d011ea52557"
      ~ tags                                           = {
            "Name"              = "management: public 10.0.2.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "management"        = "true"
            "service"           = "management"
        }
      ~ tags_all                                       = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.management.aws_subnet.all["10.0.3.0/24"] will be updated in-place
  ~ resource "aws_subnet" "all" {
        id                                             = "subnet-0a205209260302668"
      ~ tags                                           = {
            "Name"              = "management: private 10.0.3.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "management"        = "true"
            "service"           = "management"
        }
      ~ tags_all                                       = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.management.aws_vpc.vpc will be updated in-place
  ~ resource "aws_vpc" "vpc" {
        id                                   = "vpc-045eb4d598bc177c0"
      ~ tags                                 = {
            "Name"              = "VPC for management (development) 10.0.0.0/22"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "management"        = "true"
          + "module_version"    = "3.1.1"
            "service"           = "management"
        }
      ~ tags_all                             = {
          + "created_by_module" = "infrahouse/service-network/aws"
          + "module_version"    = "3.1.1"
            # (5 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # module.management.aws_vpc_endpoint.s3 will be updated in-place
  ~ resource "aws_vpc_endpoint" "s3" {
        id                         = "vpce-09965f79d37f9f02d"
      ~ tags                       = {
            "Name"              = "S3 Endpoint in management VPC"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "development"
            "service"           = "management"
        }
      ~ tags_all                   = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (4 unchanged elements hidden)
        }
        # (20 unchanged attributes hidden)
    }

  # module.management.aws_vpc_security_group_egress_rule.default[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_vpc_security_group_egress_rule" "default" {
      - arn                    = "arn:aws:ec2:us-west-1:303467602807:security-group-rule/sgr-0e8bafdbaa71207a1" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "Allow all traffic" -> null
      - id                     = "sgr-0e8bafdbaa71207a1" -> null
      - ip_protocol            = "-1" -> null
      - security_group_id      = "sg-0d78fdc7582795224" -> null
      - security_group_rule_id = "sgr-0e8bafdbaa71207a1" -> null
      - tags                   = {
          - "Name" = "outgoing traffic"
        } -> null
      - tags_all               = {
          - "Name"       = "outgoing traffic"
          - "created_by" = "infrahouse/aws-control-303467602807"
        } -> null
    }

  # module.management.aws_vpc_security_group_ingress_rule.default[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_vpc_security_group_ingress_rule" "default" {
      - arn                    = "arn:aws:ec2:us-west-1:303467602807:security-group-rule/sgr-0476ac0288f3dd7b5" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "Allow all traffic" -> null
      - id                     = "sgr-0476ac0288f3dd7b5" -> null
      - ip_protocol            = "-1" -> null
      - security_group_id      = "sg-0d78fdc7582795224" -> null
      - security_group_rule_id = "sgr-0476ac0288f3dd7b5" -> null
      - tags                   = {
          - "Name" = "incoming traffic"
        } -> null
      - tags_all               = {
          - "Name"       = "incoming traffic"
          - "created_by" = "infrahouse/aws-control-303467602807"
        } -> null
    }

  # module.actions-runner.module.record_metric.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133108100000007-INx3ry_record_metric"
      ~ last_modified                  = "2025-05-13T20:35:00.000+0000" -> (known after apply)
      ~ s3_key                         = "00be4eb3-3a13-f57e-b6d8-e9d970c9089b.zip" -> "b7f37bea-bf58-e1d0-8fce-2a70866633db.zip"
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner.module.record_metric.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "infrahouse-action-runner-lambda-20250505203126570200000001"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "b7f37bea-bf58-e1d0-8fce-2a70866633db.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = ".terraform/modules/actions-runner/modules/record_metric/b7f37bea-bf58-e1d0-8fce-2a70866633db.zip"
      + storage_class          = (known after apply)
      + tags                   = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + version_id             = (known after apply)
    }

Plan: 1 to add, 21 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEsICJjaGFuZ2UiOiAyMSwgImRlc3Ryb3kiOiA0fX0=
```
</details>